app/controllers/albums_controller.rb

SELECT * FROM "albums" WHERE ("albums"."id" = 1)
---
  def show
    if current_user
    @album = Album.find(params[:id])

INSERT INTO "albums" ("name", "created_at", "updated_at", "user_id") VALUES('this is first album of rohit', '2010-10-07 11:48:50', '2010-10-07 11:48:50', NULL)
---
  def create
    if current_user
    @album = Album.new(params[:album])
    @album.user=current_user
    if @album.save

SELECT * FROM "albums" WHERE ("albums"."id" = 6 AND ("albums".user_id = 2))
---
  def edit
    if current_user
    @album = current_user.albums.find(params[:id])

SELECT * FROM "albums" WHERE ("albums"."id" = 6 AND ("albums".user_id = 2))
---
  def update
    if current_user
    @album = current_user.albums.find(params[:id])

SELECT * FROM "albums" WHERE ("albums"."id" = 8 AND ("albums".user_id = 2))
DELETE FROM "albums" WHERE "id" = 1
---
  def destroy
    if current_user
    @album = current_user.albums.find(params[:id])
    @album.destroy