app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "crypted_password", "password_field", "updated_at", "username", "persistence_token", "password", "email") VALUES('2010-10-06 23:23:43', 'f0a68081a0897f85a1a35bb09e12e75a14bfdc230f99d2df2574519fb7ca3c900f69e166a24c3d5a47623e688d5d9632586c7d855b6f28e65ac115a933e491e1', NULL, '2010-10-06 23:23:43', 'rohit', '8500e89364471f52dd01f24c9e1531dd43df26f9a39f1739702ce19fa37f04f2cec60cac6916ca07d016b6cd1d20c8658e11338c9e9a1cfbc92acf59450752dd', NULL, 'a@gmail.com')
---
  def create
  @user = User.new(params[:user])
  if @user.save

UPDATE "users" SET "persistence_token" = '434d6db513f9f5323406f2aa845a949a18e39297232e8a7309de4e07751666ccfb679a41179c2a80cfce8c90e5d84365ce67e5813e5797cccb1fe9e409b417b9', "updated_at" = '2010-10-07 13:38:28', "crypted_password" = '7d3e34e5cd86fd1fe8a6e15940aeb6e7d85945aee0ee2456b337e3146020711b547433c0b94e4df4407ed51ec4f0c6f70e3039c3c936ff7b6fd630d3bbe81e7a' WHERE "id" = 2
---
  def update
  @user = current_user
  if @user.update_attributes(params[:user])